Revit 2026 API

# SpaceSpaceCavityRatio Property

---

Get the Space Cavity Ratio of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SpaceCavityRatio { get; }
```
```vb
Public ReadOnly Property SpaceCavityRatio As Double
	Get
```
```cpp
public:
property double SpaceCavityRatio {
	double get ();
}
```
```fsharp
member SpaceCavityRatio : float with get
```

#### Property Value

Double

This property is used to get the Space Cavity Ratio of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace